app/controllers/results_controller.rb

SELECT "results".* FROM "results"
---
  def index
    @results = Result.all

SELECT "results".* FROM "results" WHERE "results"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @result = Result.find(params[:id])

INSERT INTO "results" ("body", "created_at", "mail", "name", "tel", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", ""], ["created_at", Sun, 08 Apr 2012 13:52:54 UTC +00:00], ["mail", "mail"], ["name", "valid?です\343\202\210"], ["tel", 1], ["updated_at", Sun, 08 Apr 2012 13:52:54 UTC +00:00]]
---
  def complete
    @result = Result.new(params[:result])

    respond_to do |format|
      if @result.save

INSERT INTO "results" ("body", "created_at", "mail", "name", "tel", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @result = Result.new(params[:result])

    respond_to do |format|
      if @result.save